function merge<T extends object, U extends object>(objA: T, objB: U): T & U {
  return { ...objA, ...objB };
}
// Виначив Обєкти)

// У цьому випадку T та U обмежені типом object, що означає, що вони мають 
// представляти об'єкти. Тепер функція merge очікуватиме, що їй буде передано два 
// об'єкти та поверне об'єднаний об'єкт типу T & U.

// У цьому прикладі використовуються generics<T, U>, що вказують, що функція "merge"
// приймає два об'єкти різних типів T і U. Вона повертає об'єкт, який є 
// об'єднанням T і U за допомогою оператора &. Таким чином, ця функція може 
// працювати з будь - якими об'єктами, незалежно від їх типу.