// У даному коді, потрібно внести зміни для безпечного використання змінних.
// Оскільки "some" має тип "unknown", я не можу просто присвоїти його змінній "str",
// оскільки "unknown" є більш загальним типом, і я повинен впевнитися, що значення, яке я
// намагаюсь привласнити, справді є рядком.

// Одним зі способів зробити це є перевірка типу та приведення типу, наприклад:

let some: unknown;
some = 'Text';

let str: string;
if (typeof some === 'string') {
  str = some; // Приведення до string, оскільки я впевнився, що `some` є рядком
} else {
  // Обробка ситуації, коли `some` не є рядком
}


// Це гарантує, що я використовую "some" тільки тоді, коли впевнений в його типі.


