// Для визначення змінної в TypeScript, яка може приймати рядок або число (union type),
// я можу використовувати наступний синтаксис:

let union: string | number;

// Цей код означає, що "union" може бути або рядком, або числом.

// Щоб визначити змінну, яка може приймати тільки одне з двох рядкових значень: 'enable' 
// або 'disable'(literal type), я можу використовувати такий синтаксис:

let literal: 'enable' | 'disable';

// Це означає, що "literal" може бути або рівним рядку "enable", або рівним рядку 
// "disable", інших значень він приймати не буде.