//  Для функцій в TypeScript краще вказувати типи аргументів та значень, щоб підвищити
// типову безпеку та допомогти компілятору правильно перевіряти мій код.Ось як би я
// міг вказати типи для зазначених функцій:

// 1.Для функції showMessage:

function showMessage(message: string): void {
  console.log(message);
}

// У цьому випадку я вказав, що "message" повинно бути рядком, і функція нічого не
// повертає, тому тип значення "void".

// 2.Для функції calc:

function calc(num1: number, num2: number): number {
  return num1 + num2;
}

// Тут я вказав, що "num1" і "num2" мають бути числовими значеннями, і функція повертає число.

// 3.Для функції customError:

function customError(): never {
  throw new Error('Error');
}

// У цьому випадку я вказав, що функція не повертає жодного значення, і її тип -
// "never", оскільки вона завжди викидає помилку.

// Це допомагає TypeScript контролювати, які дані можуть бути передані у функції та які дані вона повертає.

